app/controllers/posts_controller.rb

  def show
    @posts = Post.all
---
SELECT "posts".* FROM "posts"