app/controllers/posts_controller.rb

  def index
    #This renders the form it's the view (GET) and
    @posts = Post.all
---
SELECT "posts".* FROM "posts"

  def create #Saves to the Database
   @post = Post.new(params[:post])
   if @post.save
---
INSERT INTO "posts" ("created_at", "description", "location", "price", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", Mon, 28 Oct 2013 23:11:20 UTC +00:00], ["description", "dsdfg"], ["location", nil], ["price", "fgafdg"], ["title", "dfgsdfg"], ["updated_at", Mon, 28 Oct 2013 23:11:20 UTC +00:00]]

  def edit #View to user to edit the post
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "1"]]

  def update #Tells the server to update the form
    @post = Post.find(params[:id])

    if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "title" = 'dfgadfgafdg', "updated_at" = '2013-10-29 00:09:38.816523' WHERE "posts"."id" = 1

  def delete #some form/link that says delete to the user to the user
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "21"]]

  def destroy #tells the backend to destroy that post!
    @post = Post.find(params[:id])
    @post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "19"]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 19]]

  def show #Will render all posts in the POST route.
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "1"]]